Интенсивное_обучение_программированию/src/DataProcessors/РасчетИтоговойЦены/РасчетИтоговойЦены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РасчетИтоговойЦены</name>
  <attributes>
    <name>СебестоимостьТовара</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Наценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтоговаяЦена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

Интенсивное_обучение_программированию/src/DataProcessors/РасчетИтоговойЦены/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура РасчитатьИтоговуюЦену(Команда)
	ПроверитьЗапонениеСебестоимости();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ПроверитьЗапонениеСебестоимости()
	Если НЕ ЗначениеЗаполнено(Объект.СебестоимостьТовара) Тогда
		Сообщить ("Себестоимость товара не указана");	
		Возврат;
	КонецЕсли;
	
	РасчетИтоговойЦены();
КонецПроцедуры

&НаКлиенте
Процедура РасчетИтоговойЦены()
	Объект.ИтоговаяЦена = (Объект.СебестоимостьТовара * (1 + (Объект.Наценка / 100))) 
						* (1 + (Объект.СтавкаНДС / 100));
	Сообщить (СтрШаблон("Итоговая цена = %1", Объект.ИтоговаяЦена));
КонецПроцедуры
#КонецОбласти
